/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   pwd.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jaemyu <jaemyu@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/09/17 15:25:23 by jaemyu            #+#    #+#             */
/*   Updated: 2025/09/17 15:25:23 by jaemyu           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

// pwd - 	현재 위치를 출력해주는 명령어
// pwd -L - 심볼릭 링크 안에 있다면 심볼릭 링크의 경로를 표시한다.
// pwd -P - 심볼릭 링크 안에 있다면 심볼릭 링크가 가리키는 디렉토리 경로를 표시한다.
void	pwd(t_pipe *tool)
{

}